import img1 from "../../images/lab2/lab2_2.png";
import img2 from "../../images/lab2/lab2_3.png";

export const getLab2_3_description = () => (
  <>
    <h4>Завдання №2</h4>
    <p>Cтворити окремі веб-сторінки, а саме:</p>
    <ul>
      <li>
        Розмітку за допомогою таблиці (номер варіанта – остання цифра у списку
        групи) - Група ЗПІ-зп41 має 24 студента, тому <b>номер варіанта 4</b>
      </li>
      <li>
        Розмітку за допомогою блоків (плаваючих елементів) (номер варіанта –
        остання цифра у списку групи + 1). Група ЗПІ-зп41 має 24 студента, тому
        <b>номер варіанта 5</b>
      </li>
    </ul>
    <div style={{ display: "flex" }}>
      <img src={img1} alt="option4" />
      <img src={img2} alt="option5" />
    </div>
    <p>Виконання завдання представлено в наступному пункті звіту.</p>
  </>
);
