export const getLab2_15_description = () => (
  <>
    <h4> Висновки</h4>
    <p style={{ textAlign: "justify" }}>
      У результаті виконання лабораторної роботи були розглянуті основні аспекти
      адаптивної верстки для забезпечення коректного відображення веб-сторінок
      на різних пристроях. Також було вивчено застосування метатега viewport для
      налаштування масштабу і розміру елементів на мобільних пристроях. Крім
      того, особливу увагу було приділено стратегії Mobile First, яка передбачає
      спочатку створення макету для мобільних пристроїв, а потім адаптацію для
      більш великих екранів за допомогою медіа-запитів.
    </p>
  </>
);
