export const getLab1_2_description = () => (
  <>
    <h4>Тема:</h4>
    <p>
      Cтворення сайту для продажу домашніх рослин з каталогом рослин різних
      категорій. Інтеграція функцій для полегшення пошуку потрібної рослини, з
      можливістю перегляду інформації про догляд та замовлення доставки.
    </p>
    <h4>Мета:</h4>
    <p>
      Розробка працюючого веб-застосунку, де користувачі можуть переглядати,
      вибирати та замовляти домашні рослини, а також отримувати рекомендації
      щодо догляду за ними.
    </p>
    <p>
      Посилання на репозиторій власного WEB-застосунку
      <a href="URL">тут</a>
    </p>

    <p>
      Посилання на живу сторінку власного WEB-застосунку
      <a href="URL">тут</a>
    </p>

    <p>
      Посилання на репозиторій звітного HTML-документа
      <a href="URL">тут</a>
    </p>

    <p>
      Посилання на репозиторій звітного HTML-документа
      <a href="URL">тут</a>
    </p>

    <p>
      Посилання на репозиторій на живу сторінку звітного HTML-документ
      <a href="URL">тут</a>
    </p>
    <p>
      Посилання на репозиторій з самостійними роботами
      <a href="URL">тут</a>
    </p>
    <p>
      Посилання на репозиторій живу сторінку з самостійними роботами
      <a href="URL">тут</a>
    </p>
  </>
);
