export const getLab1_9_description = () => (
  <div style={{ maxWidth: "100%" }}>
    <h2>Висновки</h2>
    <p>
      Створення веб-сайту для продажу домашніх рослин є своєчасним рішенням,
      враховуючи зростаючий інтерес до онлайн-покупок та потребу у зручних
      платформах для замовлення товарів, які зазвичай важко знайти в традиційних
      магазинах.
    </p>
    <p>
      Під час першої лабораторної роботи був пропрацьований план дій для
      досягнення цілі та чітко сформульоване завдання. Також була створена перша
      сторінка, що містить основну інформацію про магазин, популярні рослини, а
      також деяку інформацію про їхній догляд і форму для контакту з власником
      магазину.
    </p>
    <p>
      З точки зору навчання були відпрацьовані навички написання коду на HTML,
      зокрема використання тегів та атрибутів для створення форм, зображень,
      списків і посилань.
    </p>
  </div>
);
