export const getLab4_1_description = () => (
  <>
    <h4>Тема лабораторної роботи 4:</h4>
    <p style={{ textAlign: "justify" }}>
      КЛАСИ. ОБ'ЄКТНА МОДЕЛЬ ДОКУМЕНТА (DOM). ПОДІЇ. ОБ'ЄКТ ПОДІЇ. ДЕЛЕГУВАННЯ
      ПОДІЙ. THROTTLE. МОДУЛЬНОСТЬ КОДУ
    </p>
    <h4>Мета:</h4>
    <p style={{ textAlign: "justify" }}>
      придбати практичні навички роботи з об'єктами. Методи об'єкта. Callback.
      Стрілочні функції. Стрілочні функції як колбеки. Реалізація програм
      засовами мови JAVASCRIPT
    </p>
    <h4>Постановка задачі:</h4>
    <p style={{ textAlign: "justify" }}>
      Використовуючи сценарій на JavaScript, виконати наступні завдання: 1 ,3,
      5, 7, 8, 9, 10.
    </p>
    <p>
      Я знаходжусь 15 в списку стедентів , тому завдання для непарних номерів.
    </p>
  </>
);
