export const getLab5_1_description = () => (
  <>
    <h4>Тема лабораторної роботи 5:</h4>
    <p style={{ textAlign: "justify" }}>
      WEB-СХОВИЩЕ. WEB STORAGE API. МОДУЛЬНОСТЬ КОДУ. СТВОРЕННЯ МОДАЛЬНОГО
      ВІКНА.
    </p>
    <h4>Мета:</h4>
    <p style={{ textAlign: "justify" }}>
      придбати практичні навички роботи створення модального вікна; повторити
      процес створення макету, зокрема створення макету галереї довільних
      зображень; закріпити навички роботи з делегуванням подій.
    </p>
  </>
);
