export const getLab3_15_description = () => (
  <>
    <h2>Висновки до лабораторної роботи</h2>
    <ol>
      <li>
        <strong>Робота з функціями та методами JavaScript:</strong>
        <p style={{ textAlign: "justify" }}>
          У ході виконання лабораторної роботи було розглянуто кілька важливих
          аспектів роботи з функціями в JavaScript, таких як створення функцій,
          перевірка умов, використання різних структур даних (масиви, об'єкти).
        </p>
      </li>
      <li>
        <strong>Перевірка правильності коду та обробка помилок:</strong>
        <p style={{ textAlign: "justify" }}>
          Важливим аспектом було навчитися правильно перевіряти структури коду
          за допомогою різних перевірок (наприклад, перевірка правильності
          закриття дужок у функції <code>checkBrackets</code>).
        </p>
        <p style={{ textAlign: "justify" }}>
          Також була показана важливість правильного використання стеку для
          коректної перевірки дужок і правильного оброблення коду.
        </p>
      </li>
      <li>
        <strong>Робота з масивами та об'єктами:</strong>
        <p style={{ textAlign: "justify" }}>
          Задачі на роботу з масивами та об'єктами допомогли краще зрозуміти
          основи маніпуляцій з колекціями даних, такими як додавання нових
          елементів, видалення елементів і підрахунок повторюваних значень.
        </p>
        <p style={{ textAlign: "justify" }}>
          Вивчено, як обробляти та маніпулювати інформацією в масивах та
          об'єктах за допомогою методів масивів, таких як <code>forEach</code>,{" "}
          <code>map</code>, <code>indexOf</code>.
        </p>
      </li>
      <li>
        <strong>
          Підвищення навичок роботи з рядками та регулярними виразами:
        </strong>
        <p style={{ textAlign: "justify" }}>
          Завдання на перевірку правильності закриття дужок показало важливість
          правильного аналізу рядків і використання таких структур як стек для
          збереження інформації під час ітерації через символи рядка.
        </p>
      </li>
      <li>
        <strong>Загальне підвищення рівня розуміння JavaScript:</strong>
        <p style={{ textAlign: "justify" }}>
          Практичні завдання з використання функцій-конструкторів, масивів та
          об'єктів допомогли краще зрозуміти як маніпулювати даними, створювати
          ефективні функції та обробляти різні типи помилок, що виникають при
          роботі з даними.
        </p>
      </li>
    </ol>
    <p style={{ textAlign: "justify" }}>
      Загалом, лабораторна робота дозволила покращити розуміння основних
      принципів програмування в JavaScript та навички роботи з даними в реальних
      задачах.
    </p>
  </>
);
