export const getLab3_7_description = () => (
  <>
    <h2>Висновок</h2>
    <p style={{ textAlign: "justify" }}>
      У процесі виконання лабораторної роботи були реалізовані такі функції:
    </p>
    <ul>
      <li style={{ textAlign: "justify" }}>
        <strong>Функція для розрахунку вартості доставки</strong> —{" "}
        <code>getShippingMessage</code> обчислює загальну вартість доставки,
        перевіряючи типи аргументів та повертаючи повідомлення про вартість
        доставки.
      </li>
      <li style={{ textAlign: "justify" }}>
        <strong>Функція для розрахунку транзакції з дроїдами</strong> —{" "}
        <code>makeTransaction</code> обчислює загальну вартість замовлення,
        перевіряючи наявність достатньої кількості коштів на рахунку клієнта.
      </li>
      <li style={{ textAlign: "justify" }}>
        <strong>Знаходження найменшого спільного елемента в масивах</strong> —
        функція, яка знаходить найменший елемент, який є спільним для двох
        масивів.
      </li>
      <li style={{ textAlign: "justify" }}>
        <strong>Сортування масиву методом бульбашки</strong> — реалізована
        функція для сортування масиву в порядку зростання.
      </li>
      <li style={{ textAlign: "justify" }}>
        <strong>Програма-будильник</strong> — створено програму для встановлення
        часу будильника, його увімкнення та вимкнення.
      </li>
    </ul>
    <p style={{ textAlign: "justify" }}>
      Ці завдання допомогли покращити навички роботи з масивами, функціями,
      асинхронними операціями та маніпулюванням часом у JavaScript.
    </p>
  </>
);
