export const lab1a_2_description = () => (
  <>
    <p style={{ textAlign: "justify" }}>
      Селектори CSS – це інструмент для вибору HTML-елементів, до яких
      застосовуються стилі. Вони допомагають знайти елементи в документі за їх
      типом, класом, ідентифікатором чи іншими ознаками. Основні типи
      селекторів:
      <ul>
        <li>cелектор за тегом</li>
        <li>cелектор за класом</li>
        <li>cелектор за ідентифікатором</li>
        <li>комбіновані селектори</li>
        <li>псевдокласові селектори</li>
        <li>псевдоелементні селектори</li>
      </ul>
    </p>
  </>
);
