export const getLab1_1_description = () => (
  <>
    <h3>Опис предметної галузі</h3>
    <p style={{ textAlign: "justify" }}>
      Сучасне суспільство має тенденцію до покупок онлайн, включаючи товари, які
      раніше було важко уявити в інтернет-замовленнях, наприклад домашні
      рослини. Запропонована розробка буде платформою, яка допоможе користувачам
      не тільки замовити рослину онлайн, але й отримати всю необхідну інформацію
      про догляд, а в разі потреби — задати додаткові питання.
    </p>

    <h4>Тема:</h4>
    <p style={{ textAlign: "justify" }}>
      Cтворення сайту для продажу домашніх рослин з каталогом рослин різних
      категорій. Інтеграція функцій для полегшення пошуку потрібної рослини, з
      можливістю перегляду інформації про догляд та замовлення доставки.
    </p>

    <h4>Мета:</h4>
    <p style={{ textAlign: "justify" }}>
      Розробка працюючого веб-застосунку, де користувачі можуть переглядати,
      вибирати та замовляти домашні рослини, а також отримувати рекомендації
      щодо догляду за ними.
    </p>
    <h4>Бізнес логіка::</h4>
    <ul>
      <li>Користувач переглядає інформацію про магазин. </li>
      <li>
        Користувач переглядає інформацію про про рослину (догляд, полив,
        освітлення).
      </li>
      <li>Користувач реєструється (імлементована лише ui частина )</li>
      <li>Користувач авторизується (імлементована лише ui частина )</li>
      <li>
        Користувач може посортувати товари представлені в магазині для більшої
        зручності вибору
      </li>
    </ul>
  </>
);
