export const lab1a_7_description = () => (
  <>
    <p>Протягом самостійної роботи 2 я ознайомилась з наступними темами: </p>
    <ul>
      <li>
        <strong>Основи CSS</strong>: синтаксис, селектори, кольори, фони.
      </li>
      <li>
        <strong>Стилізація елементів</strong>: межі, відступи, розміри, блокова
        модель.
      </li>
      <li>
        <strong>Текст і шрифти</strong>: вирівнювання, декорування, Google
        Fonts.
      </li>
      <li>
        <strong>Таблиці та списки</strong>: стилі, адаптивність, оформлення.
      </li>
      <li>
        <strong>Продвинутий CSS</strong>: анімації, тіні, переходи,
        заокруглення.
      </li>
      <li>
        <strong>Практика</strong>: адаптивний дизайн, багатоколонковість,
        підказки.
      </li>
    </ul>
    <p>
      В наступних пунктах цього звітного документу будуть пресдтавлені деякі
      приклади використання цих знань
    </p>
  </>
);
